//Написать программу, которая на вход принимает число, на выход выдает его квадрат
Console.Write("Enter number: ");
string answer = Console.ReadLine();
int number=Convert.ToInt32(answer);

Console.WriteLine(number*number);